## Pandas

### 1. Series

In [1]:
import pandas as pd
import numpy as np

labels = ["a", "b", "c"] # list of strings
num = [10, 20, 30] # list of int
arr = np.array(num) # array
d = {"a" : 10, "b" : 20, "c" : 30} # dictionary

In [2]:
# syntax
ser = pd.Series(data = num)
ser
# or
# pd.Series(num)

0    10
1    20
2    30
dtype: int64

In [3]:
# with indexing
ser_i = pd.Series(data = num, index = labels)
ser_i
# or
# pd.Series(num, labels)

a    10
b    20
c    30
dtype: int64

In [4]:
pd.Series(arr, labels) # takes array as data and labels as labels
pd.Series(d) # takes keys as labels and values as data

a    10
b    20
c    30
dtype: int64

In [5]:
ser1 = pd.Series([1, 2, 3, 4], ["USA", "Germany", "Russia", "Japan"])
ser1

USA        1
Germany    2
Russia     3
Japan      4
dtype: int64

In [6]:
ser2 = pd.Series([1, 2, 5, 4], ["USA", "Germany", "Italy", "Japan"])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [7]:
print(ser1["USA"]) # Since "USA" is the index

1

In [8]:
print(ser1 + ser2)

Germany    4.0
Italy      NaN
Japan      8.0
Russia     NaN
USA        2.0
dtype: float64

### 2. DataFrame

In [9]:
data = {
"Name": ["Aisha", "Rahul", "John", "Neha", "Imran"],
"Marks": [85, 92, 78, 65, 55],
"City": ["Mumbai", "Delhi", "Chennai", "Bangalore", "Hyderabad"],
"Age": [22, 25, 23, 21, 24]
}

In [10]:
df = pd.DataFrame(data)
df

    Name  Marks       City  Age
0  Aisha     85     Mumbai   22
1  Rahul     92      Delhi   25
2   John     78    Chennai   23
3   Neha     65  Bangalore   21
4  Imran     55  Hyderabad   24

In [11]:
# save dictionary to csv
df.to_csv("students.csv", index = False)
print("CSV file created.")

CSV file created.

In [12]:
# read csv
df = pd.read_csv("students.csv")
df

    Name  Marks       City  Age
0  Aisha     85     Mumbai   22
1  Rahul     92      Delhi   25
2   John     78    Chennai   23
3   Neha     65  Bangalore   21
4  Imran     55  Hyderabad   24

In [13]:
# top n values
print("Head: \n\n", df.head(2))

# last n values
print("\nTail: \n\n", df.tail(2))

Head:

     Name  Marks    City  Age
0  Aisha     85  Mumbai   22
1  Rahul     92   Delhi   25

Tail:

     Name  Marks       City  Age
3   Neha     65  Bangalore   21
4  Imran     55  Hyderabad   24

In [14]:
print("Shape: ", df.shape)
print("\nColumns: \n\n", df.columns)
print("\nDescribe: \n\n", df.describe())

Shape:  (5, 4)

Columns:

 Index(['Name', 'Marks', 'City', 'Age'], dtype='object')

Describe:

            Marks        Age
count   5.000000   5.000000
mean   75.000000  23.000000
std    14.983324   1.581139
min    55.000000  21.000000
25%    65.000000  22.000000
50%    78.000000  23.000000
75%    85.000000  24.000000
max    92.000000  25.000000

In [15]:
# selecting specific column
print(df["Name"])

0    Aisha
1    Rahul
2     John
3     Neha
4    Imran
Name: Name, dtype: object

In [16]:
# selecting specific columns
print(df[["Name", "Marks"]])

    Name  Marks
0  Aisha     85
1  Rahul     92
2   John     78
3   Neha     65
4  Imran     55

In [17]:
# selecting specific rows
df.loc[[2, 3]]

   Name  Marks       City  Age
2  John     78    Chennai   23
3  Neha     65  Bangalore   21

In [18]:
# selecting subset of data
df.loc[[0, 3],["Marks"]]

   Marks
0     85
3     65

In [19]:
print(type(df["Name"])) # type is Series, prints single column

<class 'pandas.core.series.Series'>

***Creating a new column***

In [20]:
# 1. Assign a constant value

df["Gender"] = ["Female", "Male", "Male", "Female", "Male"]
df

    Name  Marks       City  Age  Gender
0  Aisha     85     Mumbai   22  Female
1  Rahul     92      Delhi   25    Male
2   John     78    Chennai   23    Male
3   Neha     65  Bangalore   21  Female
4  Imran     55  Hyderabad   24    Male

In [21]:
# 2. Based on existing columns

df["CGPA"] = df["Marks"] / 10
df

    Name  Marks       City  Age  Gender  CGPA
0  Aisha     85     Mumbai   22  Female   8.5
1  Rahul     92      Delhi   25    Male   9.2
2   John     78    Chennai   23    Male   7.8
3   Neha     65  Bangalore   21  Female   6.5
4  Imran     55  Hyderabad   24    Male   5.5

In [22]:
# 3. Using conditional logic

df["Status"] = df["Marks"].apply(lambda x: "Pass" if x > 70 else "Fail") # data transformation
df

    Name  Marks       City  Age  Gender  CGPA Status
0  Aisha     85     Mumbai   22  Female   8.5   Pass
1  Rahul     92      Delhi   25    Male   9.2   Pass
2   John     78    Chennai   23    Male   7.8   Pass
3   Neha     65  Bangalore   21  Female   6.5   Fail
4  Imran     55  Hyderabad   24    Male   5.5   Fail

***Deleting a column***

In [23]:
df.drop("Status", axis = 1) # drops a column but does not save it

    Name  Marks       City  Age  Gender  CGPA
0  Aisha     85     Mumbai   22  Female   8.5
1  Rahul     92      Delhi   25    Male   9.2
2   John     78    Chennai   23    Male   7.8
3   Neha     65  Bangalore   21  Female   6.5
4  Imran     55  Hyderabad   24    Male   5.5

In [24]:
df

    Name  Marks       City  Age  Gender  CGPA Status
0  Aisha     85     Mumbai   22  Female   8.5   Pass
1  Rahul     92      Delhi   25    Male   9.2   Pass
2   John     78    Chennai   23    Male   7.8   Pass
3   Neha     65  Bangalore   21  Female   6.5   Fail
4  Imran     55  Hyderabad   24    Male   5.5   Fail

In [25]:
df.drop("CGPA", axis = 1, inplace = True) # saves it

In [26]:
df

    Name  Marks       City  Age  Gender Status
0  Aisha     85     Mumbai   22  Female   Pass
1  Rahul     92      Delhi   25    Male   Pass
2   John     78    Chennai   23    Male   Pass
3   Neha     65  Bangalore   21  Female   Fail
4  Imran     55  Hyderabad   24    Male   Fail

In [27]:
df.drop("Status", axis = 1, inplace = True) # saves it

***Creating a row***

In [28]:
# 1. Using concat()

data = {"Name" : "Sara", "Marks" : 88, "City" : "Kolkata", "Age" : 23, "Gender": "Female"}
new_row = pd.DataFrame([data]) # must convert dictionary to DataFrame before concatinating
new_row

   Name  Marks     City  Age  Gender
0  Sara     88  Kolkata   23  Female

In [29]:
df = pd.concat([df, new_row], ignore_index = True) # without ignore_index the index for the new row would be 0

In [30]:
df

    Name  Marks       City  Age  Gender
0  Aisha     85     Mumbai   22  Female
1  Rahul     92      Delhi   25    Male
2   John     78    Chennai   23    Male
3   Neha     65  Bangalore   21  Female
4  Imran     55  Hyderabad   24    Male
5   Sara     88    Kolkata   23  Female

In [31]:
# 2. Using loc to append at the end

df.loc[len(df)] = ["Alex", 85, "Pune", 21, "Male"]
df

    Name  Marks       City  Age  Gender
0  Aisha     85     Mumbai   22  Female
1  Rahul     92      Delhi   25    Male
2   John     78    Chennai   23    Male
3   Neha     65  Bangalore   21  Female
4  Imran     55  Hyderabad   24    Male
5   Sara     88    Kolkata   23  Female
6   Alex     85       Pune   21    Male

***Deleting a row***

In [32]:
df.drop(index = 5, axis = 0)

    Name  Marks       City  Age  Gender
0  Aisha     85     Mumbai   22  Female
1  Rahul     92      Delhi   25    Male
2   John     78    Chennai   23    Male
3   Neha     65  Bangalore   21  Female
4  Imran     55  Hyderabad   24    Male
6   Alex     85       Pune   21    Male

In [33]:
df

    Name  Marks       City  Age  Gender
0  Aisha     85     Mumbai   22  Female
1  Rahul     92      Delhi   25    Male
2   John     78    Chennai   23    Male
3   Neha     65  Bangalore   21  Female
4  Imran     55  Hyderabad   24    Male
5   Sara     88    Kolkata   23  Female
6   Alex     85       Pune   21    Male

In [34]:
df.drop(index = 6, axis = 0, inplace = True)

In [35]:
df

    Name  Marks       City  Age  Gender
0  Aisha     85     Mumbai   22  Female
1  Rahul     92      Delhi   25    Male
2   John     78    Chennai   23    Male
3   Neha     65  Bangalore   21  Female
4  Imran     55  Hyderabad   24    Male
5   Sara     88    Kolkata   23  Female

In [36]:
# index changing
df["Name_Index"]=["A", "R", "J", "N", "I", "S"]
df.set_index("Name_Index", inplace = True)
df

             Name  Marks       City  Age  Gender
Name_Index
A           Aisha     85     Mumbai   22  Female
R           Rahul     92      Delhi   25    Male
J            John     78    Chennai   23    Male
N            Neha     65  Bangalore   21  Female
I           Imran     55  Hyderabad   24    Male
S            Sara     88    Kolkata   23  Female

In [37]:
df.loc["A"]

Name       Aisha
Marks         85
City      Mumbai
Age           22
Gender    Female
Name: A, dtype: object

In [38]:
df.iloc[0]

Name       Aisha
Marks         85
City      Mumbai
Age           22
Gender    Female
Name: A, dtype: object

In [39]:
df.reset_index(inplace = True)

df

In [41]:
df.loc[0]

Name_Index         A
Name           Aisha
Marks             85
City          Mumbai
Age               22
Gender        Female
Name: 0, dtype: object

***Filters***

In [47]:
high_scores = df[df["Marks"] > 70]
print("Marks more than 70: \n\n", high_scores)

Marks more than 70:

   Name_Index   Name  Marks     City  Age  Gender
0          A  Aisha     85   Mumbai   22  Female
1          R  Rahul     92    Delhi   25    Male
2          J   John     78  Chennai   23    Male
5          S   Sara     88  Kolkata   23  Female

In [46]:
filtered = df[(df["Marks"] > 70) & (df["Age"] > 22)]
print("Marks > 70 and Age > 22: \n\n", filtered)

Marks > 70 and Age > 22:

   Name_Index   Name  Marks     City  Age  Gender
1          R  Rahul     92    Delhi   25    Male
2          J   John     78  Chennai   23    Male
5          S   Sara     88  Kolkata   23  Female

***Data Transformation***

In [49]:
df["Status"] = df["Marks"].apply(lambda x: "Pass" if x >= 70 else "Fail")
print(df)

  Name_Index   Name  Marks       City  Age  Gender Status
0          A  Aisha     85     Mumbai   22  Female   Pass
1          R  Rahul     92      Delhi   25    Male   Pass
2          J   John     78    Chennai   23    Male   Pass
3          N   Neha     65  Bangalore   21  Female   Fail
4          I  Imran     55  Hyderabad   24    Male   Fail
5          S   Sara     88    Kolkata   23  Female   Pass

In [51]:
sorted_df = df.sort_values("Marks", ascending = False)
print("Sorted Data: \n\n", sorted_df)

Sorted Data:

   Name_Index   Name  Marks       City  Age  Gender Status
1          R  Rahul     92      Delhi   25    Male   Pass
5          S   Sara     88    Kolkata   23  Female   Pass
0          A  Aisha     85     Mumbai   22  Female   Pass
2          J   John     78    Chennai   23    Male   Pass
3          N   Neha     65  Bangalore   21  Female   Fail
4          I  Imran     55  Hyderabad   24    Male   Fail

In [52]:
df2 = df.copy()
df2.loc[2, "City"] = None # create missing value
df2

  Name_Index   Name  Marks       City  Age  Gender Status
0          A  Aisha     85     Mumbai   22  Female   Pass
1          R  Rahul     92      Delhi   25    Male   Pass
2          J   John     78       None   23    Male   Pass
3          N   Neha     65  Bangalore   21  Female   Fail
4          I  Imran     55  Hyderabad   24    Male   Fail
5          S   Sara     88    Kolkata   23  Female   Pass

In [54]:
print(df2.isnull().sum()) # counts null in each column

Name_Index    0
Name          0
Marks         0
City          1
Age           0
Gender        0
Status        0
dtype: int64

In [55]:
df2_filled = df2.fillna("Unknown")
print(df2_filled)

  Name_Index   Name  Marks       City  Age  Gender Status
0          A  Aisha     85     Mumbai   22  Female   Pass
1          R  Rahul     92      Delhi   25    Male   Pass
2          J   John     78    Unknown   23    Male   Pass
3          N   Neha     65  Bangalore   21  Female   Fail
4          I  Imran     55  Hyderabad   24    Male   Fail
5          S   Sara     88    Kolkata   23  Female   Pass

In [59]:
df.to_csv("students_modified.csv", index = False)